{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "Heya",
        "Hi There",
        "Hola",
        "Ciao",
        "How are you",
        "Is anyone there?",
        "Hello",
        "Good day",
        "Whats up"
      ],
      "responses": [
        "Hello!",
        "Good to see you again!",
        "Hi there, how can I help?"
      ],
      "context_set": ""
    },
    {
      "tag": "goodbye",
      "patterns": [
        "cya",
        "See you later",
        "Goodbye",
        "I am Leaving",
        "Have a Good day",
        "Bye"
      ],
      "responses": ["Sad to see you go :(", "Talk to you later", "Goodbye!"],
      "context_set": ""
    },
    {
      "tag": "age",
      "patterns": [
        "how old",
        "how old is ciara",
        "what is your age",
        "how old are you",
        "age?"
      ],
      "responses": ["I am 18 years old!", "18 years young!"],
      "context_set": ""
    },
    {
      "tag": "name",
      "patterns": [
        "what is your name",
        "what should I call you",
        "whats your name?",
        "Got a Name?",
        "who are you",
        "what are you"
      ],
      "responses": [
        "You can call me ciara.",
        "I'm ciara!",
        "I'm Ciara Chatbot."
      ],
      "context_set": ""
    },
    {
      "tag": "shop",
      "patterns": [
        "Id like to buy something",
        "whats on the menu",
        "what do you reccommend?",
        "could i get something to eat"
      ],
      "responses": [
        "We sell chocolate chip cookies for $2!",
        "Cookies are on the menu!"
      ],
      "context_set": ""
    },
    {
      "tag": "hours",
      "patterns": [
        "when are you guys open",
        "what are your hours",
        "hours of operation"
      ],
      "responses": ["We are open 7am-4pm Monday-Friday!"],
      "context_set": ""
    },
    {
      "tag": "jokes",
      "patterns": [
        "Tell me a joke",
        "Do you know any jokes",
        "How about a joke",
        "Give me a joke",
        "Make me laugh",
        "I need cheering up"
      ],
      "responses": [
        "I met a Dutch girl with inflatable shoes last week, phoned her up to arrange a date but unfortunately she'd popped her clogs.  ",
        "So I said 'Do you want a game of Darts?' He said, 'OK then', I said nearest to bull starts'. He said, 'Baa', I said, 'Moo', he said, You're closest'.  ",
        "The other day I sent my girlfriend a huge pile of snow. I rang her up; I said 'Did you get my drift?'  ",
        "So I went down the local supermarket, I said, 'I want to make a complaint, this vinegar's got lumps in it', he said, 'Those are pickled onions'.  ",
        "I saw this bloke chatting up a cheetah; I thought, 'He's trying to pull a fast one'.  ",
        "So I said to this train driver 'I want to go to Paris'. He said 'Eurostar?' I said, 'I've been on telly but I'm no Dean Martin'.  ",
        "I said to the Gym instructor 'Can you teach me to do the splits?' He said, 'How flexible are you?' I said, 'I can't make Tuesdays'.  ",
        "But I'll tell you what I love doing more than anything: trying to pack myself in a small suitcase. I can hardly contain myself.  ",
        "I went to the Chinese restaurant and this duck came up to me with a red rose and says 'Your eyes sparkle like diamonds'. I said, 'Waiter, I asked for a-ROMATIC duck'.  ",
        "So this bloke says to me, 'Can I come in your house and talk about your carpets?' I thought, 'That's all I need, a Je-hoover's witness'.  ",
        "I rang up British Telecom, I said, 'I want to report a nuisance caller', he said 'Not you again'.  ",
        "I was having dinner with a world chess champion and there was a check tablecloth. It took him two hours to pass me the salt.  ",
        "He said, 'You remind me of a pepper-pot', I said 'I'll take that as a condiment'.  ",
        "I was in the supermarket and I saw this man and woman wrapped in a barcode. I said, 'Are you two an item?'  ",
        "A lorry-load of tortoises crashed into a trainload of terrapins, I thought, 'That's a turtle disaster'.  ",
        "Four fonts walk into a bar the barman says 'Oi - get out! We don't want your type in here'  ",
        "A three-legged dog walks into a saloon in the Old West. He slides up to the bar and announces: 'I'm looking for the man who shot my paw.'  ",
        "Two antennas meet on a roof, fall in love and get married. The ceremony wasn't much, but the reception was excellent.",
        "Two hydrogen atoms walk into a bar. One says, 'I've lost my electron.' The other says, 'Are you sure?' The first replies, 'Yes, I'm positive...'",
        "A jumper cable walks into a bar. The bartender says,  'I'll serve you but don't start anything.'",
        "A sandwich walks into a bar. The bartender  says, 'Sorry we don't serve food in here.'",
        "A man walks into a bar with a slab of asphalt under his arm and says: 'A beer please, and one for the road.'",
        "Two cannibals are eating a clown. One says to  the other: 'Does this taste funny to you?'",
        "'Doc, I can't stop singing 'The Green, Green Grass of Home.'' 'That sounds like Tom Jones Syndrome.' 'Is it common?' 'It's Not Unusual.'",
        "Two cows standing next to each other in a field. Daisy says to Dolly, 'I was artificially inseminated this morning.' 'I don't believe you', said Dolly. 'It's true, no bull!' exclaimed Daisy.",
        "An invisible man marries an invisible woman. The kids were nothing to look at either.",
        "I went to buy some camouflage trousers the other day but I couldn't find any.",
        "I went to the butcher's the other day to bet him 50 bucks that he couldn't reach the meat off the top shelf. He said, 'No, the steaks are too high.'",
        "I went to a seafood disco last week and pulled a mussel.",
        "A man goes into a bar and says, 'Can I have a bottle of less?' 'What's that?', asks the barman, 'Is it the name of a beer?' 'I don't know', replies the man, 'but my doctor says I have to drink it.'",
        "A man returns from an exotic holiday and is feeling very ill. He goes to see his doctor, and is immediately rushed to the hospital to undergo some tests. The man wakes up after the tests in a private room at the hospital, and the phone by his bed rings. 'This is your doctor. We have the results back from your tests and we have found you have an extremely nasty disease called M.A.D.S. It's a combination of Measles, AIDS, Diphtheria, and Shingles!'  'Oh my gosh', cried the man, 'What are you going to do, doctor?'  'Well we're going to put you on a diet of pizzas, pancakes, and pita bread.' replied the doctor.  'Will that cure me?' asked the man.  The doctor replied, 'Well no, but, it's the only food we can slide under the door.'",
        "A man strolls into a lingerie shop and asks the assistant: 'Do you have a see-through negligee, size 46-48-52?' The assistant looks bewildered. 'What the heck would you want to see through that for?'!",
        "Did you hear about the Buddhist who refused the offer of Novocain during his root canal work? He wanted to transcend dental medication.",
        "Pete goes for a job on a building site as an odd-job man. The foreman asks him what he can do. 'I can do anything' says Pete. 'Can you make tea?' asks the foreman. 'Sure, yes', replies Pete. 'I can make a great cup of tea.' 'Can you drive a forklift?' asks the foreman, 'Good grief!' replies Pete. 'How big is the teapot?'",
        "Stevie Wonder got a cheese grater for his birthday. He said it was the most violent book he'd ever read.",
        "A man is stopped by an angry neighbour. 'I'd just left the house this morning to collect my newspaper when that evil Doberman of yours went for me!' 'I'm astounded', said the dog's owner. 'I've been feeding that fleabag for seven years and it's never got the paper for me.'",
        "A man visits his doctor: 'Doc, I think I'm losing it', he says',I'm forever dreaming I wrote Lord Of The Rings.' 'Hmm. One moment', replies the doctor, consulting his medical book. 'Ah yes, now I see... you've been Tolkien in your sleep.'",
        " police officer on a motorcycle pulls alongside a man driving around the M25 in an open-topped sports car and flags him down. The policeman solemnly approaches the car. 'Sir, I'm sorry to tell you your wife fell out a mile back', he says. 'Oh, thank goodness', the man replies. 'I thought I was going deaf.'",
        "Two men walking their dogs pass each other in a graveyard. The first man says to the second, 'Morning.' 'No', says the second man. 'Just walking the dog.'",
        "A brain went into a bar and said, 'Can I have a pint of lager please, mate?' 'No way', said the barman. 'You're already out of your head.'",
        "A man walks into a surgery. 'Doctor!' he cries. 'I think I'm shrinking!' 'I'm sorry sir, there are no appointments at the moment', says the physician. 'You'll just have to be a little patient.'"
      ],
      "context_set": ""
    }
  ]
}
